In [42]:
import pandas as pd
import seaborn as sns

In [3]:
# brzo o funkcijama

def my_func():
    pass

In [5]:
def my_sq(x):
    """Racuna kvadrat unetog broja"""
    return x**2

In [6]:
def avg(x,y):
    """Racuna srednju vrednost unetih brojeva"""
    return (x+y)/2

In [7]:
my_sq(9)

81

In [8]:
avg(9,7)

8.0

# Apply bazicno

In [11]:
df=pd.DataFrame({"a":[10,20,30],
               "b":[20,30,40]})
df

    a   b
0  10  20
1  20  30
2  30  40

In [18]:
# prolazak kroz nas skup podataka sa for petljom je najsporiji metod koji mozemo da koristimo 
df["a"]**2

0    100
1    400
2    900
Name: a, dtype: int64

In [19]:
#kako radi apply
def print_me(x):
    print(x)

In [22]:
# vidimo da ona prolazi kroz kolone jednu po jednu po difoltu
df.apply(print_me)

0    10
1    20
2    30
Name: a, dtype: int64
0    20
1    30
2    40
Name: b, dtype: int64

a    None
b    None
dtype: object

In [33]:
try:
    df.apply(avg)
except:
    print("Greska, ocekujem dve vrenosti a ti si mi dao samo jednu")

Greska, ocekujem dve vrenosti a ti si mi dao samo jednu

In [31]:
#zato koristimo malo drugacij kodiranju funkciju
def avg_3(col):
    
    x=col[0]
    y=col[1]
    z=col[2]
    
    return (x+y+z)/3

In [34]:
df.apply(avg_3)

a    20.0
b    30.0
dtype: float64

In [35]:
# Ako zelimo red po red 
df

    a   b
0  10  20
1  20  30
2  30  40

In [41]:
# df.apply(avg_3,axis=1) # jer radimo x+y+z a imamo samo dve kolone
# moramo ponovo da rekodiramo nasu funkciju 

#zato koristimo malo drugacij kodiranju funkciju
def avg_2(row):
    
    """sredn vrednsot dva broja"""
    
    x=row[0]
    y=row[1]
    
    return (x+y)/3

df.apply(avg_2,axis=1)

0    10.000000
1    16.666667
2    23.333333
dtype: float64

In [13]:
df["a"].apply(my_sq)

0    100
1    400
2    900
Name: a, dtype: int64

In [14]:
def my_exp(x,e):
    """Stepenujem x na stepem e"""
    return x**e

In [16]:
# Primena apply koristeci vise argumenata
df["a"].apply(my_exp,e=2)

0    100
1    400
2    900
Name: a, dtype: int64

# Sa realnim dataset

In [45]:
titanic = sns.load_dataset("titanic")
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [48]:
# imamo nedostajuce podatke 
# hajde da izracunamo broj i frekfenciju nedostajucih podataka
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
survived       891 non-null int64
pclass         891 non-null int64
sex            891 non-null object
age            714 non-null float64
sibsp          891 non-null int64
parch          891 non-null int64
fare           891 non-null float64
embarked       889 non-null object
class          891 non-null category
who            891 non-null object
adult_male     891 non-null bool
deck           203 non-null category
embark_town    889 non-null object
alive          891 non-null object
alone          891 non-null bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.6+ KB

In [49]:
import numpy as np

# pisemo trii funkcije

 * 1 Broj nedostajuch podatka
 * 2 Proporcija nedostajucih podatka
 * 3 Proporcije celih vrednosti

In [54]:
sum([True, False, True])

2

In [58]:
def count_missing(vec):
    """ukupno nedostajucih podatka u vectoru"""
    
    null_vec=pd.isnull(vec) # vektor True/ False
    null_count=np.sum(null_vec) # True ima vrednost 1
    return null_count

In [59]:
def prop_missing(vec):
    
    """vraca proporcionalnu vrednost nepostajucih vrednosti"""
    num=count_missing(vec)
    dem=vec.size
    return num/dem

In [78]:
def prop_count(vec):
    return 1 - prop_missing(vec)

In [66]:
titanic.apply(count_missing)

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [84]:
# uglavnom kod ovih nedostajucih vrednosti dobroj eje proveriti da oni stvanpo nedostaju
titanic.loc[pd.isnull(titanic["embark_town"]),:]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
61,1,1,female,38.0,0,0,80.0,NaN,First,woman,False,B,NaN,yes,True
829,1,1,female,62.0,0,0,80.0,NaN,First,woman,False,B,NaN,yes,True

# primena an Redovima

In [72]:
#koliko ima neostajucih podatka po svakom redu
titanic.apply(count_missing,axis=1)

0      1
1      0
2      1
3      0
4      1
      ..
886    1
887    0
888    2
889    0
890    1
Length: 891, dtype: int64

In [73]:
# kolika je vresdnost po nedostajucim podacima
titanic.apply(count_missing,axis=1).value_counts()

1    549
0    182
2    160
dtype: int64

In [79]:
titanic.apply(prop_count)

survived       1.000000
pclass         1.000000
sex            1.000000
age            0.801347
sibsp          1.000000
parch          1.000000
fare           1.000000
embarked       0.997755
class          1.000000
who            1.000000
adult_male     1.000000
deck           0.227834
embark_town    0.997755
alive          1.000000
alone          1.000000
dtype: float64

In [82]:
def clean_l_colum(single_column):
    return single_column[1:]

In [83]:
clean_l_colum("d43")

'43'